examples/eulerian_module_examples/E1_vortex_filament_flow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default	CrankNicolson 0.7;
}

gradSchemes
{
    default	cellLimited Gauss linear 0.5;
    grad(U)	cellLimited Gauss linear 1;
}

divSchemes
{
    default                        none;
    div(phi,U)         		   Gauss linearUpwind grad(U);	// TVD scheme for velocity field
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;	// TVD scheme for velocity field
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
